KulichenkoViacheslav/STM32Labs/MCU_SYSTEM/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUTTON_Pin GPIO_PIN_0
#define BUTTON_GPIO_Port GPIOA
#define MY_HAND_Pin GPIO_PIN_1
#define MY_HAND_GPIO_Port GPIOA
#define LAPTOP_TX_Pin GPIO_PIN_2
#define LAPTOP_TX_GPIO_Port GPIOA
#define LAPTOP_RX_Pin GPIO_PIN_3
#define LAPTOP_RX_GPIO_Port GPIOA
#define SERIAL_FLASH_SCK_Pin GPIO_PIN_5
#define SERIAL_FLASH_SCK_GPIO_Port GPIOA
#define TEMP_SENSOR_Pin GPIO_PIN_1
#define TEMP_SENSOR_GPIO_Port GPIOB
#define DISP_RS_Pin GPIO_PIN_7
#define DISP_RS_GPIO_Port GPIOE
#define DISP_PWM_LED_Pin GPIO_PIN_9
#define DISP_PWM_LED_GPIO_Port GPIOE
#define DISP_RW_Pin GPIO_PIN_10
#define DISP_RW_GPIO_Port GPIOE
#define DISP_ENA_Pin GPIO_PIN_11
#define DISP_ENA_GPIO_Port GPIOE
#define DISP_DB4_Pin GPIO_PIN_12
#define DISP_DB4_GPIO_Port GPIOE
#define DISP_DB5_Pin GPIO_PIN_13
#define DISP_DB5_GPIO_Port GPIOE
#define DISP_DB6_Pin GPIO_PIN_14
#define DISP_DB6_GPIO_Port GPIOE
#define DISP_DB7_Pin GPIO_PIN_15
#define DISP_DB7_GPIO_Port GPIOE
#define INDICATOR_SCL_Pin GPIO_PIN_10
#define INDICATOR_SCL_GPIO_Port GPIOB
#define INDICATOR_SDA_Pin GPIO_PIN_11
#define INDICATOR_SDA_GPIO_Port GPIOB
#define LED_GREEN_Pin GPIO_PIN_12
#define LED_GREEN_GPIO_Port GPIOD
#define LED_ORANGE_Pin GPIO_PIN_13
#define LED_ORANGE_GPIO_Port GPIOD
#define LED_RED_Pin GPIO_PIN_14
#define LED_RED_GPIO_Port GPIOD
#define LED_BLUE_Pin GPIO_PIN_15
#define LED_BLUE_GPIO_Port GPIOD
#define SERIAL_FLASH_CE_Pin GPIO_PIN_7
#define SERIAL_FLASH_CE_GPIO_Port GPIOD
#define SERIAL_FLASH_MISO_Pin GPIO_PIN_4
#define SERIAL_FLASH_MISO_GPIO_Port GPIOB
#define SERIAL_FLASH_MOSI_Pin GPIO_PIN_5
#define SERIAL_FLASH_MOSI_GPIO_Port GPIOB
#define EEPROM_SCL_Pin GPIO_PIN_6
#define EEPROM_SCL_GPIO_Port GPIOB
#define EEPROM_SDA_Pin GPIO_PIN_9
#define EEPROM_SDA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
